app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "resourceId", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "title" = ?, "description" = ?, "resourceId" = ?, "end_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "Raghu"], ["description", "The Prof"], ["resourceId", 4], ["end_time", "2016-11-28 00:21:00.000000"], ["updated_at", "2016-11-18 21:36:57.732804"], ["id", 2]]